[
    {
        "Unnamed: 0": 3096,
        "timestamp": 1487246811,
        "eventType": "CONTENT SHARED",
        "contentId": -4029704725707465084,
        "authorPersonId": 6013226412048763966,
        "authorSessionId": -6569695881431984742,
        "authorUserAgent": "Mozilla\/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit\/537.36 (KHTML, like Gecko) Chrome\/56.0.2924.87 Safari\/537.36",
        "authorRegion": "SP",
        "authorCountry": "BR",
        "contentType": "HTML",
        "url": "http:\/\/www.cnbc.com\/2016\/12\/21\/former-google-career-coach-shares-a-useful-visual-trick.html",
        "title": "Former Google career coach shares a visual trick for figuring out what to do with your life",
        "text": "If you want 2017 to be an exciting year, design it that way. That's the advice of former Google career coach and job strategist Jenny Blake , who has helped more than a thousand people improve their work lives. She recommends creating a \"mind map,\" a visual diagram of your interests and goals. Drawing one doesn't take long and could help you figure out the next project, hobby or career change that will make the new year happier and more successful, Blake says. \"My favorite way to brainstorm creatively, whether it's about values or setting goals for the new year, is through mind maps,\" Blake tells CNBC. To make one, write down the year at the center of a piece of paper, and then draw spokes with different themes that are important to you. For example, your spokes could be business, personal life, health and fitness, fun, or skill building. From each of those themes, draw additional spokes to connect the themes to ways you want to improve or experiment in that area. Blake recommends you ask yourself: \"What's important to me about that? And what does success look like?\" For example, in \"personal life,\" you could write, \"Meet up with a friend at least once a month\" or \"Take a music class.\" The visual trick works because it helps you see the different ways you can improve, Blake writes in her book \" Pivot: The Only Move That Matters Is Your Next One .\" \"With mind mapping you are taking pen to paper, going old-school,\" Blake says. And if you're like many professionals who sit too much and stare too long at a computer, drawing might actually be fun. \"The goal is to break out of linear thinking,\" Blake says. \"Go broad. Go big. Go sideways, and then experiment to see which of your ideas is most likely to lead to a resonant next step.\" Video by Andrea Kramar.",
        "lang": "en",
        "total_events": 433.0
    },
    {
        "Unnamed: 0": 1671,
        "timestamp": 1467813728,
        "eventType": "CONTENT SHARED",
        "contentId": -133139342397538859,
        "authorPersonId": 4918484843075254252,
        "authorSessionId": -5701227433817087697,
        "authorUserAgent": null,
        "authorRegion": null,
        "authorCountry": null,
        "contentType": "HTML",
        "url": "http:\/\/gq.globo.com\/Prazeres\/Poder\/Carreira\/noticia\/2016\/06\/novo-workaholic-trabalha-pratica-esportes-e-tem-tempo-para-familia-conheca.html",
        "title": "Novo workaholic trabalha, pratica esportes e tem tempo para a família. Conheça",
        "text": "Novo workaholic não abre mão do esporte e da família (Foto: iStock) Se alguém, um dia, precisar reunir os personagens desta reportagem para uma rodada de negócios, fica aqui uma sugestão: marque o encontro na Vila Olímpica. Maratona, triatlo, judô, taekwondo e windsurfe são algumas das modalidades praticadas - em alguns casos com dedicação e resultados semiprofissionais - por este pequeno conjunto de executivos. Mas boa sorte com as agendas. Todos presidem empresas, obviamente com rotinas intensas, e dificilmente permitem que compromissos extracurriculares roubem o tempo sagrado para suas famílias ou, no caso dos solteiros, para os hobbies que fazem brilhar seus olhos. Representantes de uma geração que conviveu com chefes e colegas viciados em trabalho (e em certos momentos se confundiram com eles), esses profissionais fizeram do esporte a pedra angular para a construção de rotinas criativas. Sua dedicação a empresas tão diferentes entre si como P&G, Leo Burnett e Unisys não é avaliada pelo número de horas passadas no escritório, uma obsessão típica dos velhos baby boomers. \"Talvez porque eles não tivessem outros interesses na vida\", afirma Alberto Ogata, diretor técnico da Associação Brasileira de Qualidade de Vida (ABQV). Tampouco é medida pelos símbolos de status corporativo que conspiravam contra a saúde dos executivos, a começar pela vaga de estacionamento próxima ao elevador. Pelas novas regras com as quais eles estão subvertendo o jogo corporativo, o que vale são os resultados entregues e o modo como se dá essa entrega: com equilíbrio e foco invejáveis. É o que permite a altos executivos, em posições de destaque nas companhias que lideram, terem vidas saudáveis, interessantes e, quase sempre, divertidas. É o que faz deles a primeira geração dos chamados novos workaholics. O ponto de partida para essa mudança de paradigma encontra-se no Vale do Silício. O engravatado durão que demitia 10% de seus funcionários todo ano deu lugar ao ex-hippie. E as empresas passaram a trocar horários a cumprir por tarefas a executar Com idades entre 40 e 50 anos, eles estão no auge de suas carreiras, lideram multinacionais e têm vasta experiência internacional. São todos apaixonados pelos esportes que praticam, mas têm uma visão utilitária da atividade física. Em troca da disciplina férrea que tira a maioria deles da cama antes de o sol nascer, esperam benefícios (aplicáveis ao trabalho) como energia, serenidade e capacidade de executar impecavelmente sob pressão. Pragmaticamente, eles estão trocando quantidade por qualidade no trabalho porque entenderam que mais tempo no escritório não significa mais trabalho feito. Um estudo recente da Business Roundtable, uma associação de CEOs de grandes empresas nos EUA, concluiu que embora um pico concentrado de muitas horas de trabalho possa aumentar o rendimento em prazos curtos (fechamentos de trimestre, lançamento de produtos, etc.), longas jornadas sistemáticas tendem a diminuir a produtividade. Os pesquisadores constataram que pessoas trabalhando 60 horas por semana - ou 12 horas por dia - durante dois meses não produziram mais do que num regime tradicional de 40 horas semanais - ou oito horas diárias. Já uma semana de 80 horas provoca burnout em menos de um mês. Há raízes históricas para a transformação em curso. \"No início dos anos 80 tivemos as primeiras manifestações de executivos que se saturaram da busca pelo sucesso, justamente por terem percebido que o custo de alcançá-lo é imenso\", afirma o professor Esdras Vasconcellos, do Departamento de Psicologia Social e do Trabalho da Universidade de São Paulo. \"Naquela época, reduzir o ritmo era mais difícil. Então, alguns abdicaram da carreira executiva.\" Ouviam-se casos anedóticos de executivos que largavam tudo para abrir uma pousada no Nordeste. No auge da onda workaholic, eles tiveram o insight que originou o que Vasconcellos chama de ecologia da vida. \"Esse novo pensamento não traz uma abdicação da vida civilizada, moderna, até certo ponto consumista\", pondera. \"Traz, sim, uma leveza simbolizada pela troca do tênis (longas partidas, alta competitividade) pela ioga (meditação, retiros espirituais).\" Geograficamente, o ponto de partida para essa mudança de paradigma encontra-se no Vale do Silício - não por acaso, na Califórnia. Volte aos anos 60. Ali floresceu todo o movimento hippie, toda a contracultura que influenciou São Francisco e região. \"Esses anos revolucionários romperam totalmente com valores antigos\", afirma Vasconcellos. Duas décadas depois, a Califórnia estava no epicentro do surgimento da informática, do computador pessoal como facilitador de processos de trabalho. Placas tectônicas do mundo corporativo se moveram durante o período de ascensão e estrelato de Steve Jobs. Da sua explosão como empreendedor, nos anos 80, à sua assimilação pelo establishment empresarial na primeira década do século 21 - que coincide com o caso de Jack Welch, até então o grande ícone do executivo vencedor e o protótipo do workaholic. O engravatado durão que demitia 10% de seus funcionários todo ano deu lugar ao ex-hippie com grande apetite por LSD, meditação e comida vegana. Era o início de uma revolução cultural. Pragmática. As empresas, ao perceber que a permissão para que as pessoas trabalhem com um pouco mais de leveza acaba trazendo resultados, decidiram relaxar. Trocaram horários a cumprir por tarefas a executar. Os ambientes de trabalho ganharam quadras de esporte, áreas de lazer, restaurantes gourmet. Se workaholic é o profissional que não consegue ou tem grande dificuldade de se desconectar do trabalho, o que importa não é o número de hobbies e atividades esportivas que ele encaixa na rotina. O desafio para esse executivo é o poder de se desligar Esse movimento ganhou impulso com uma mudança na cultura das empresas na década de 90, quando começa a implantação dos programas de qualidade de vida. A geração que estava, então, em início de carreira já recebeu esse novo modelo mental de autogerenciamento nos seus anos de formação. \"Esses executivos têm consciência elevada e tratam a saúde como elemento de sustentabilidade pessoal\", diz Carlos Legal, sócio da consultoria Legalas, especializada em educação corporativa. Parte deles abre mão voluntariamente de posições no topo das organizações. Todavia, há aqueles que querem tudo: chegar ao topo de suas empresas, porém sem sacrificar vida pessoal e vida familiar. Na visão de Vicky Bloch, uma das mais renomadas coachs de CEOs do país, o perfil predominante no topo das companhias brasileiras ainda é o do workaholic clássico. Profissionais atléticos são pontos fora da curva e não um retrato fiel da realidade do Brasil, onde 51% das mulheres e 47% dos homens hoje são sedentários. A obesidade é uma epidemia, sobretudo na base da pirâmide organizacional das empresas. Mas isso está mudando, e rapidamente. \"Estamos em transição\", nota Vicky. A mudança maior está se dando com a entrada no primeiro escalão das empresas de executivos na faixa de 35 a 45 anos. Pessoas que já são associadas ao que ela chama de geração flexível, no que diz respeito à sua relação com o tempo e o espaço em que o trabalho é executado. Gente mais saudável, sem dúvida, mas não necessariamente menos viciada em trabalho, pondera Vicky. Afinal, se workaholic é o sujeito que não consegue se desconectar do trabalho, o que importa não é o número de hobbies e atividades esportivas que ele encaixa na rotina. O desafio é o poder de se desligar. Alguns sintomas típicos do antigo vício em trabalho, é bem verdade, tornam-se mais raros na geração flexível - como os casamentos desfeitos. De acordo com as pesquisas de Bryan Robinson, psicoterapeuta, professor emérito da Universidade da Carolina do Norte e autor do livro Chained to the Desk (\"Acorrentado à Mesa\", sem edição em português), casamentos com ao menos um cônjuge workaholic têm 40% mais riscos de acabar em divórcio. Contudo, se a cachaça do workaholic é o trabalho, a dependência, em muitos casos, continua presente. \"Só que hoje ele não trabalha apenas no escritório\", diz Vicky. \"Trabalha em casa, no carro, correndo.\" O próximo desafio, então, talvez seja completar a transição desses novos workaholics em autênticos pós-workaholics. A troca da guarda geracional, sem dúvida, está fazendo sua parte. Basta conferir o depoimento de Ricardo Sangion, principal executivo da rede social Pinterest no Brasil. Mais jovem do time aqui reunido, ele se orgulha de dormir muito, trabalhar pouco, entregar resultados e ainda ter tempo para administrar um site, um bar e uma pousada na Bahia. Nem tudo, porém, se resume à idade. Valores antes reprimidos estão sendo integrados à vida executiva. \"A espiritualidade passa a ser importante\", exemplifica o professor Vasconcellos. E há o poderoso efeito demonstração. \"As empresas começam a perceber que até profissionais na posição de CEO já não estão mais disponíveis para alcançar resultados a qualquer preço\", observa o consultor Carlos Legal. Ao dizer que não estão dispostos a fazer qualquer tipo de sacrifício para chegar ao topo, esses profissionais aceleram o processo de mudança no próprio modo de funcionar das organizações.",
        "lang": "pt",
        "total_events": 315.0
    },
    {
        "Unnamed: 0": 1814,
        "timestamp": 1468867647,
        "eventType": "CONTENT SHARED",
        "contentId": -6783772548752091658,
        "authorPersonId": 4918484843075254252,
        "authorSessionId": -8995217520473210153,
        "authorUserAgent": null,
        "authorRegion": null,
        "authorCountry": null,
        "contentType": "HTML",
        "url": "http:\/\/www.caroli.org\/livro-retrospectivas-divertidas\/",
        "title": "Livro: Retrospectivas Divertidas",
        "text": "Neste livro, nós fornecemos um conjunto de ferramentas de atividades para transformar um grupo de pessoas em um time eficaz. Manter a diversão para os participantes e proporcionar um ambiente onde todos poderão refletir e discutir sem perder a diversão é fundamental para a melhoria contínua. Apresentaremos aqui um catálogo de atividades diversas, apropriadas, uma a uma, a diferentes contextos e equipes. Todas equipes devem fazer uma retrospectiva por semana, a menos que estejam sem tempo. Daí devem fazer duas!",
        "lang": "pt",
        "total_events": 294.0
    },
    {
        "Unnamed: 0": 1317,
        "timestamp": 1465484901,
        "eventType": "CONTENT SHARED",
        "contentId": 8657408509986329668,
        "authorPersonId": -8020832670974472349,
        "authorSessionId": 838596071610016700,
        "authorUserAgent": null,
        "authorRegion": null,
        "authorCountry": null,
        "contentType": "HTML",
        "url": "https:\/\/medium.com\/practical-blend\/pull-request-first-f6bb667a9b6",
        "title": "Pull request first - Practical Blend",
        "text": "Pull request first After two years of working with pull requests a bit differently from the norm, I now take for granted that most developers submit pull requests only once their work is \"ready\" for review. Obviously... right? Or... not? There's a different approach I'd argue provides more transparency to your team, makes sure everyone is aligned and helps to keep a historical record of what decisions were made when developing a feature. Simply... Open a pull request before you write code.* Wait, what? Rather than treating pull requests solely as means for reviewing code, use the pull request as the master of record for the work related to a feature. This isn't a new idea - this is an approach our product team at bitHound practiced for nearly 2 years, inspired by GitHub itself ( Zach Holman's talk explains it). * And yes, technically GitHub requires at least one commit to open a pull request, so you have to write something first. There are several benefits that we saw from adopting this approach: Increased transparency Your Open Pull Requests view on GitHub becomes an instant snapshot of the current state of dev work in your company. Isn't that what the scrum board is for? Oh, sure it is - and once everyone races to move\/write their stickies 30 seconds before standup, you'll get a similar view (for about 5 minutes). Specs as you go By using checkboxes in the pull request description , you can build out the current list of todos, what issues the pull request addresses, and update that as you uncover hidden gotchas during development. Those checkbox counts even bubble up to your pull request list for easy at-a-glance status updates. This allows other collaborators to know what the progress is on the feature, and let's them jump in at the appropriate spot. We'd often use these checkboxes to track issues we discovered in development rather than opening new tickets. Or, reference existing issues that will get closed when the pull request gets merged . Continuous review Why review when someone has \"finished\" only to realize they might have taken a wrong turn somewhere early in development? With open pull requests as you work, reviews can be done as the work is done. Sure this isn't always practical when everyone is super busy, but it works great when you're bringing a new team member on board, or just working on a doozy of a feature. It's helped catch problems before they become disasters. Great for asynchronous\/remote work While our work style was very much centred around in-person discussion, we did have enough occasions where someone was working remotely (home, different country, whatever). I found that this is where the pull request was critical in understanding the state of the project. As long as you kept the pull request current, it didn't matter if you missed an earlier Slack or office discussion that changed its direction. What's the catch? Is everyone on board? Like any approach to organizing your work, it's only as good as the effort the team puts into it. So you need to keep each other honest to make sure pull requests are updated in a timely fashion. Does it scale? I don't know. Like any methodology, make sure it makes sense for you. When it stops working, tweak something or look for alternatives. What's the priority? Unlike a scrum board, there is no clear indication of progress as you can't reorder open pull requests (without the use of some extensions at least), but you can probably get away with a good labeling\/milestone system that helps alleviates this.",
        "lang": "en",
        "total_events": 294.0
    },
    {
        "Unnamed: 0": 588,
        "timestamp": 1461629452,
        "eventType": "CONTENT SHARED",
        "contentId": -6843047699859121724,
        "authorPersonId": 7527226129639571966,
        "authorSessionId": -1297230017812472163,
        "authorUserAgent": null,
        "authorRegion": null,
        "authorCountry": null,
        "contentType": "HTML",
        "url": "https:\/\/medium.com\/@jeffersoncn\/ganhe-6-meses-de-acesso-ao-pluralsight-maior-plataforma-de-treinamento-online-dd2b1c9a22b9",
        "title": "Ganhe 6 meses de acesso ao Pluralsight, maior plataforma de treinamento online",
        "text": "Ganhe 6 meses de acesso ao Pluralsight, maior plataforma de treinamento online Muitos não sabem, mas o Pluralsight é uma das melhores, senão a melhor, plataforma de treinamentos online. Com quase 5000 cursos nas áreas de desenvolvimento, infraestrutura, dados, entre outras e que são ministrados por mais de 800 especialistas, é fácil reconhecer o valor de se ter acesso a uma biblioteca tão rica de conhecimento como esta. Abaixo temos exemplos de alguns cursos dentre a lista dos mais populares da plataforma: Building a Web App with ASP.NET Core RC1, MVC 6, EF7 & AngularJS Angular 2: Getting Started ASP.NET Core 1.0 Fundamentals C# Fundamentals with Visual Studio 2015 Building Applications with ASP.NET MVC 4 JavaScript Best Practices ASP.NET MVC 5 Fundamentals TypeScript Fundamentals Docker for Web Developers Applying Functional Principles in C# ASP.NET in Multi-tenant App, Examples in MVC, ExtJS, and Angular Python Fundamentals Java Fundamentals: The Java Language Rapid JavaScript Training C# Best Practices: Improving on the Basics Design Patterns Library Getting Started with Entity Framework 6 Rebuilding Web Forms Applications in MVC Advanced JavaScript Building Your First Xamarin.Android App from Start to Store Building Web Applications with Node.js and Express 4.0 WCF End-to-End WPF and MVVM: Test Driven Development of ViewModels Se interessou por algum deles? E que tal ganhar uma assinatura gratuita de 6 meses com acesso completo à toda essa coleção de cursos do Pluralsight e começar agora a aprender aquelas habilidades que você vem buscado desenvolver? A Microsoft em parceria com o Pluralsight nos oferecem essa oportunidade! Quer saber como? Então vamos lá! Primeiramente precisamos nos inscrever no programa Visual Studio Dev Essentials utilizando uma conta Microsoft ( hotmail , live ou outlook ). O cadastro é simples e gratuito e você pode fazê-lo nesse link : 2. Agora que já temos acesso ao Visual Studio Dev Essentials , podemos então clicar em \" Get Code \" que fica próximo ao logo do Pluralsight . 3. Ao clicar em \" Get Code \" aparecerá em seu lugar \" Activate \", que ao ser clicado, vai nos redirecionar para a página de cadastro do Pluralsight . 4. No formulário de cadastro, o campo do código já estará preenchido, bastando entrar com as informações restantes antes de clicar em \" Activate Benefit \". 5. Pronto! Você pode agora aproveitar os seus 6 meses de estudos no Pluralsight gratuitamente. Dica extra pra quem tem condição de aluno verificada no Dreamspark Também é possível obter uma assinatura de 3 meses gratuitamente no Pluralsight através do Dreamspark . No catálogo de software do Dreamspark , ao rolar a página até o final e chegar na sessão \" Treinamento e Certificação \", clique no logo do Pluralsight ou acesse esse link . Selecione o idioma: English e clique em \" Obter chave \". No final da página há um link para o resgate do código que irá redirecionar para o cadastro no Pluralsight . Preencha os dados, ative o benefício e pronto! Agora você tem um acesso de 3 meses a todos os cursos do Pluralsight ! Espero que aproveitem bem os estudos! Até a próxima!",
        "lang": "pt",
        "total_events": 281.0
    }
]